<template>
  <v-card flat class="containerWrap">
    <h2>Салонные фильтры</h2>
    <v-card flat class="productImg">
      <v-img :src="image"></v-img>
    </v-card>

    <p class="textProduct">
      Caлoнныe фильтpы GооdWill® изгoтaвливaютcя c иcпoльзoвaниeм фильтpoвaльных мaтepиaлoв c aнтибaктepиaльнoй
      oбpaбoткoй и угoльным нaпoлнитeлeм, cдepживaющих pocт микpoфлopы, вpeдных микpoopгaнизмoв, бaктepий и пoпaдaниe их
      в caлoн aвтoмoбиля. Caлoнныe фильтpы “GооdWill” вecьмa эффeктивнo пpeпятcтвуют пpoникнoвeнию в caлoн aвтoмoбиля
      пыли, выхлoпных гaзoв, caжи и цвeтoчнoй пыльцы, умeньшaя угpoзу здopoвью вoдитeля и пaccaжиpoв.
    </p>
    <p class="textProduct">
      Фильтры салона, называемые также кабинными фильтрами или фильтрами внутреннего пространства, предназначены для
      очистки воздуха, которым
      дышит водитель и пассажиры, в любом виде наземного транспорта.
      Воздух, с дорожного полотна, нагнетается через систему вентиляции или кондиционирования, в кабину автомобиля.
      В настоящее время, практически не встретить автомобиля, который бы не имел таких фильтров, поскольку наличие
      фильтра, это уже давно не
      синоним роскоши, а одно из основных требований общей системы безопасности. Быстро возникающее ощущение
      усталости, сенной насморк,
      слезоотделение или затруднение дыхания, оказывают резко отрицательно влияние на реакцию водителя и могут
      представлять собой реальную угрозу
      безопасности дорожного движения. Такого рода симптомы, у водителя, часто вызываются загрязнениями, проникающими
      вместе с воздухом, приходящим из внешней
      среды, простыми словами, вся грязь и пыль с дороги, оказывается в салоне Вашего автомобиля.
    </p>
    <p class="textProduct">
      Концентрация различных видов загрязнения воздуха зависит от многих факторов, а именно: от времени года, погодных
      условий, загрязнение
      воздуха, от местной промышленности, а также, от интенсивности дорожного движения. В кабине автомобиля, если не
      установлен фильтр салона,
      запыленность может до пяти-шести раз превышать концентрацию «грязи» в наружном воздухе, поскольку при включённой
      приточной вентиляции или
      открытом окне – кабина действует как сборщик пыли, в пылесосе.
      Вдыхание загрязненного воздуха приводит к отрицательным, а зачастую необратимым последствиям, для человеческого
      здоровья. Несмотря на
      естественные преграды, а также действие защитных механизмов, заключающихся в самоочищении дыхательных путей и
      легких, подавляющее большинство
      загрязнений попадает в бронхи или непосредственно в легочные пузырьки, становясь источником инфекции.
    </p>
    <p class="textProduct">
      В эффективности работы салонного фильтра каждый может убедиться лично. Достаточно взглянуть, на отработавший свой
      срок фильтр салона.
      Сознание того, что большинство скопившихся там загрязнений могло бы оказаться в Ваших легких, является самым
      убедительным аргументом,
      в пользу применения таких фильтров.
    </p>
  </v-card>
</template>

<script>
export default {
  name: "salonFilters",
  data() {
    return {
      image: require('~/assets/filters/salonFilters.jpg'),
    }
  },
}
</script>

<style lang="scss" scoped>
.containerWrap {
  margin-left: 5px;
  margin-right: 5px;

  .productImg {
    float: left;
    margin: 5px 10px 0 0;
    width: 50%;
  }

  .textProduct {
    text-align: justify;
    font-size: 18px;
    text-indent: 25px;
    line-height: 1.4;
  }
}
</style>
